def calculator_probability(event_type: str, event: int) -> float:
    """
    Вычисляет вероятность события. 
     
    Args: 
        event_type: Тип события(монетка, кубик, ваш текст здесь)
        event: событие(сторона монетки, число на кубике, ваш текст здесь)
    Return: 
        Веротность события
    """
    если событие монетка: 
        то возвращаем веротяноть выпадения монетки на любую сторону
    иначе если событие кубик:
        возвращаем веротяность выпадения како-либо числа 
     
     ваш код дальнейшей реализации здесь
    
    иначе: 
        райс велью еррор (неверный тип события)